In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
from collections import Counter

In [89]:
from tqdm import tqdm

In [90]:
import json

In [91]:
import tqdm.notebook as tq

In [92]:
from pandas import Panel

/home/tanmay/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  """Entry point for launching an IPython kernel.

In [93]:
tqdm.pandas()

/home/tanmay/anaconda3/lib/python3.7/site-packages/tqdm/std.py:658: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  from pandas import Panel

In [3]:
import os 
import sys

In [4]:
from tqdm import tqdm

In [5]:
import tqdm.notebook as tq

In [7]:
df = pd.DataFrame({'c1': range(10), 
                  'c2': ["a,b,c,d"]*10})

In [8]:
df

   c1       c2
0   0  a,b,c,d
1   1  a,b,c,d
2   2  a,b,c,d
3   3  a,b,c,d
4   4  a,b,c,d
5   5  a,b,c,d
6   6  a,b,c,d
7   7  a,b,c,d
8   8  a,b,c,d
9   9  a,b,c,d

In [9]:
def split_names(x):
    
    """
    A df function that will split a string of names for further processing
    """
    
    return [n for n in x.split(',') if (not pd.isna(x) and not x == '')]

In [11]:
df['c2'] = df['c2'].apply(lambda x:split_names(x))

In [20]:
df2 = pd.DataFrame({'name':['a', 'b', 'c', 'd'], 'vals': [1,2,3,4]}, index = range(4))

In [21]:
df2

  name  vals
0    a     1
1    b     2
2    c     3
3    d     4

In [12]:
df

   c1            c2
0   0  [a, b, c, d]
1   1  [a, b, c, d]
2   2  [a, b, c, d]
3   3  [a, b, c, d]
4   4  [a, b, c, d]
5   5  [a, b, c, d]
6   6  [a, b, c, d]
7   7  [a, b, c, d]
8   8  [a, b, c, d]
9   9  [a, b, c, d]

In [13]:
df[['c3', 'c4', 'c5', 'c6']] = pd.DataFrame(df.c2.to_list(), index = df.index)

In [24]:
m = df.melt(id_vars='c1', 
        value_vars=['c3', 'c4', 'c5', "c6"]).drop(columns=['variable'])

In [25]:
m

    c1 value
0    0     a
1    1     a
2    2     a
3    3     a
4    4     a
5    5     a
6    6     a
7    7     a
8    8     a
9    9     a
10   0     b
11   1     b
12   2     b
13   3     b
14   4     b
15   5     b
16   6     b
17   7     b
18   8     b
19   9     b
20   0     c
21   1     c
22   2     c
23   3     c
24   4     c
25   5     c
26   6     c
27   7     c
28   8     c
29   9     c
30   0     d
31   1     d
32   2     d
33   3     d
34   4     d
35   5     d
36   6     d
37   7     d
38   8     d
39   9     d

In [28]:
pd.merge(m, df2, left_on='value', right_on='name').groupby('c1').agg({'vals':[np.mean, np.std]})

   vals
   mean       std
c1
0   2.5  1.290994
1   2.5  1.290994
2   2.5  1.290994
3   2.5  1.290994
4   2.5  1.290994
5   2.5  1.290994
6   2.5  1.290994
7   2.5  1.290994
8   2.5  1.290994
9   2.5  1.290994

In [38]:
test = {'a':[1,4], 'b':[2,3], 'c':[3,6], 'd':[4,5]}

In [39]:
pd.DataFrame.from_dict(test, orient = 'index')

   0  1
a  1  4
b  2  3
c  3  6
d  4  5

## Feature Engineering

I'll Use this section to explore some feature engineering

### Professional Quality

A strong intuitive predictor of the quality of a movie comes from the cast and the crew of that movie. Thus we need to figure out a way to encode these values

In [40]:
title_rating_principal = pd.read_csv('processed/title_rating_principal.csv')

In [43]:
prof_qual_df = title_rating_principal.groupby('nconst').agg({"averageRating": [np.mean, np.std, max]})

In [44]:
prof_qual_df.to_csv('processed/prof_qual_df.csv')

In [72]:
prof_qual_df

          averageRating
                   mean       std  max
nconst
nm0000001      6.869697  0.834445  9.0
nm0000002      6.910000  1.032946  9.2
nm0000003      6.008475  1.271340  8.9
nm0000004      6.778571  0.772786  7.9
nm0000005      6.904464  0.761860  8.4
...                 ...       ...  ...
nm9993616      6.500000       NaN  6.5
nm9993650      5.300000       NaN  5.3
nm9993690      6.300000       NaN  6.3
nm9993691      6.300000       NaN  6.3
nm9993693      5.900000  2.969848  8.0

[961113 rows x 3 columns]

In [100]:
prof_qual_df['averageRating']['mean'].mean()

6.259640942673017

In [101]:
prof_qual_df['averageRating']['std'].mean()

0.9623025831076207

In [102]:
prof_qual_df['averageRating']['max'].mean()

6.634021493829783

In [46]:
title_rating_principal.isnull().sum()

tconst                  0
titleType               0
primaryTitle            0
originalTitle           0
isAdult                 0
startYear             273
endYear           2885447
runtimeMinutes     287924
genres              90058
averageRating           0
numVotes                0
ordering                0
nconst                  0
category                0
job                     0
characters              0
dtype: int64

In [58]:
title_rating_principal['category'].unique()

array(['actor', 'director', 'writer', 'cinematographer', 'actress',
       'producer', 'composer', 'production_designer', 'self', 'editor',
       'archive_footage', 'archive_sound'], dtype=object)

In [59]:
role_cat_dict = {'cast': ['actor', 'actress', 'self'],
                 'crew': ['director', 'writer', 'cinematographer',
                          'producer', 'composer', 'production_designer',
                          'editor','archive_footage', 'archive_sound']}

In [54]:
roles_df = title_rating_principal.groupby('nconst').agg({"category": lambda x: list(x)})

In [56]:
roles_df['category'] = roles_df['category'].apply(lambda x: set(x))

In [57]:
roles_df

                                                    category
nconst
nm0000001                     {actor, archive_footage, self}
nm0000002                   {archive_footage, actress, self}
nm0000003                   {archive_footage, actress, self}
nm0000004                           {actor, archive_footage}
nm0000005  {writer, producer, actor, director, archive_fo...
...                                                      ...
nm9993616                                            {actor}
nm9993650                                            {actor}
nm9993690                                            {actor}
nm9993691                                          {actress}
nm9993693                                          {actress}

[961113 rows x 1 columns]

In [60]:
roles_df.to_csv('processed/roles_df.csv')

In [116]:
cc_df = title_rating_principal.groupby('tconst').agg({'nconst':lambda x: list(x)})

In [117]:
cc_df

                                                      nconst
tconst
tt0000502  [nm0215752, nm0252720, nm0063413, nm0657268, n...
tt0000574  [nm0675239, nm0846887, nm0846894, nm1431224, n...
tt0000591  [nm0906197, nm0332182, nm1323543, nm1759558, n...
tt0000615  [nm3071427, nm0581353, nm0888988, nm0240418, n...
tt0000630       [nm0624446, nm0143333, nm0000636, nm0209738]
...                                                      ...
tt9916362  [nm5813626, nm3766704, nm0107165, nm0266723, n...
tt9916428  [nm3611859, nm9445072, nm8594703, nm0422639, n...
tt9916460  [nm8796794, nm10538444, nm8691452, nm10538443,...
tt9916538  [nm4700236, nm8678236, nm1417182, nm10041459, ...
tt9916730  [nm6096005, nm0059461, nm13233318, nm4852679, ...

[323111 rows x 1 columns]

In [118]:
def get_prof_metrics(x):
    
#     print(x)
    cc = x['nconst']
    
    cast_mean = []
    cast_std = []
    cast_max = []
    crew_mean = []
    crew_std = []
    crew_max = []
    for person in cc:
#         print(person)
        roles = roles_df.loc[person]['category']
        for role in roles:
            if role in role_cat_dict['cast']:
                cast_mean.append(prof_qual_df.loc[person]['averageRating']['mean'])
                cast_std.append(prof_qual_df.loc[person]['averageRating']['std'])
                cast_max.append(prof_qual_df.loc[person]['averageRating']['max'])
            elif role in role_cat_dict['crew']:
                crew_mean.append(prof_qual_df.loc[person]['averageRating']['mean'])
                crew_std.append(prof_qual_df.loc[person]['averageRating']['std'])
                crew_max.append(prof_qual_df.loc[person]['averageRating']['max'])
    if cast_mean:            
        x['cast_mean'] = sum(cast_mean)/len(cast_mean)
    else:
        x['cast_mean'] = 6.259640942673017
    if cast_std:
        x['cast_std'] = sum(cast_std)/len(cast_std)
    else:
        x['cast_std'] = 0.9623025831076207
        
    if cast_max:
        x['cast_max'] = sum(cast_max)/len(cast_max)
    else:
        x['cast_max'] = 6.634021493829783
    if crew_mean:
        
        x['crew_mean'] = sum(crew_mean)/len(crew_mean)
    else:
        x['crew_mean'] = 6.259640942673017
        
    if crew_std:
        x['crew_std'] = sum(crew_std)/len(crew_std)
    else:
        x['crew_std'] = 0.9623025831076207
        
    if crew_max:
        x['crew_max'] = sum(crew_max)/len(crew_max)
    else:
        x['crew_max'] = 6.634021493829783
    
    return x
#     print(roles)

In [120]:
cc_df = cc_df.apply(lambda x: get_prof_metrics(x), axis = 1)

  0%|          | 468/323111 [00:19<1:38:37, 54.53it/s]

In [121]:
cc_df.to_csv('cc_df.csv')

In [122]:
cc_df

,nconst,cast_mean,cast_std,cast_max,crew_mean,crew_std,crew_max
tconst,,,,,,,
tt0000502,"[nm0215752, nm0252720, nm0063413, nm0657268, n...",4.500000,NaN,4.500000,5.357143,1.016246,6.366667
tt0000574,"[nm0675239, nm0846887, nm0846894, nm1431224, n...",6.000000,NaN,6.000000,5.802778,NaN,6.033333
tt0000591,"[nm0906197, nm0332182, nm1323543, nm1759558, n...",5.178571,NaN,5.725000,4.800000,0.282843,5.000000
tt0000615,"[nm3071427, nm0581353, nm0888988, nm0240418, n...",4.800000,NaN,5.100000,4.766667,NaN,5.133333
tt0000630,"[nm0624446, nm0143333, nm0000636, nm0209738]",5.337500,1.242302,6.650000,5.801958,1.409807,7.575000
...,...,...,...,...,...,...,...
tt9916362,"[nm5813626, nm3766704, nm0107165, nm0266723, n...",6.148864,NaN,7.575000,6.353927,NaN,7.028571
tt9916428,"[nm3611859, nm9445072, nm8594703, nm0422639, n...",4.542778,NaN,5.083333,4.691667,1.100755,6.000000
tt9916460,"[nm8796794, nm10538444, nm8691452, nm10538443,...",9.300000,NaN,9.300000,9.300000,NaN,9.300000
tt9916538,"[nm4700236, nm8678236, nm1417182, nm10041459, ...",7.267708,NaN,8.300000,7.083557,NaN,8.300000
tt9916730,"[nm6096005, nm0059461, nm13233318, nm4852679, ...",7.784167,NaN,8.550000,7.869444,NaN,8.400000

In [84]:
cast_mean

[5.414285714285714, 5.5, 5.199999999999999, 4.6]

In [85]:
cast_max

[6.6, 6.1, 5.6, 4.6]

In [82]:
prof_qual_df.loc['nm0906197']['averageRating']

mean    5.414286
std     0.620292
max     6.600000
Name: nm0906197, dtype: float64

In [71]:
roles_df.loc['nm0906197']

category    {actor}
Name: nm0906197, dtype: object